/* No comment provided by engineer. */
"Facebook error" = "שגיאה בפייסבוק";

/* No comment provided by engineer. */
"Internet connection error" = "החיבור לאינטרנט לא זמין";

/* Default DejalActivtyView label text */
"Loading..." = "טוען...";

/* No comment provided by engineer. */
"Login failed" = "התחברות נכשלה";

/* No comment provided by engineer. */
"Login..." = "מתחבר...";

/* No comment provided by engineer. */
"Please try again later." = "נסה שוב מאוחר יותר";

/* No comment provided by engineer. */
"Session is no longer valid. Please log in again" = "נסה שוב מאוחר יותר";

